import { defineThemeConfig } from 'vuepress-theme-plume'
import { navbar } from './navbar'
import notes from './notes/index'

/**
 * @see https://theme-plume.vuejs.press/config/basic/
 */
export default defineThemeConfig({
  logo: 'https://laneljc-1321736255.cos.ap-nanjing.myqcloud.com/pic/202501202043127.png',

  appearance: false,  // 配置 深色模式

  social: [
    { icon: 'github', link: 'https://github.com/Lane0218' },
    {
      icon: { svg: '<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path fill="currentColor" d="M11.984 0A12 12 0 0 0 0 12a12 12 0 0 0 12 12a12 12 0 0 0 12-12A12 12 0 0 0 12 0zm6.09 5.333c.328 0 .593.266.592.593v1.482a.594.594 0 0 1-.593.592H9.777c-.982 0-1.778.796-1.778 1.778v5.63c0 .327.266.592.593.592h5.63c.982 0 1.778-.796 1.778-1.778v-.296a.593.593 0 0 0-.592-.593h-4.15a.59.59 0 0 1-.592-.592v-1.482a.593.593 0 0 1 .593-.592h6.815c.327 0 .593.265.593.592v3.408a4 4 0 0 1-4 4H5.926a.593.593 0 0 1-.593-.593V9.778a4.444 4.444 0 0 1 4.445-4.444h8.296Z" /></svg>', name: 'gitee' },
      link: 'https://gitee.com/Lane0218'
    },
    {
      icon: { svg: '<svg t="1740977866546" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2017" id="mx_n_1740977866547" width="200" height="200"><path d="M512 992C246.896 992 32 777.104 32 512 32 246.896 246.896 32 512 32c265.104 0 480 214.896 480 480 0 265.104-214.896 480-480 480z m16-387.68c32.672 4.08 64.48 4.8 96.32 1.968 21.6-1.92 42.016-7.84 60.16-20.544 35.824-25.12 46.672-79.872 22.736-115.36-13.712-20.352-34.512-28.448-56.96-33.28-32.864-7.072-66.048-5.392-99.232-3.2-5.312 0.336-6.336 2.88-6.784 7.696-2.88 30.64-6.128 61.232-9.2 91.84-2.352 23.264-4.624 46.528-7.04 70.88z m50.064-31.808c1.84-19.6 3.408-36.88 5.088-54.16 1.456-14.912 3.2-29.792 4.432-44.72 0.336-4.016 1.456-6.24 5.584-5.984 14.64 0.976 29.728 0.032 43.808 3.424 34.208 8.272 45.68 50.912 21.888 77.84-14.832 16.784-34.464 22.112-55.552 23.52-7.936 0.512-15.952 0.08-25.248 0.08zM512 439.152c-2.048-0.608-3.312-1.104-4.624-1.344-35.36-6.448-70.96-7.808-106.544-2.64-19.664 2.848-38.448 8.896-53.888 21.872-21.552 18.112-20.288 43.92 4.128 58.128 12.24 7.12 26.272 11.728 39.936 16.208 13.2 4.32 27.184 6.4 40.448 10.56 11.808 3.68 13.136 13.424 3.36 20.912-3.136 2.4-6.976 4.768-10.816 5.392-10.496 1.712-21.28 4.112-31.712 3.344-22.592-1.664-45.04-5.12-68.016-7.904-1.28 9.952-2.752 21.648-4.272 33.696 3.92 1.28 7.2 2.56 10.56 3.392 31.824 7.968 64.112 9.008 96.48 4.8 18.832-2.448 37.008-7.408 53.152-17.84 26.816-17.328 34.4-53.616-4.384-70.672-13.6-5.984-28.304-9.76-42.64-14.144-10.704-3.264-21.856-5.264-32.368-8.928-9.168-3.2-10.448-11.44-2.848-17.248 4.368-3.328 10.048-6.56 15.36-6.912a450.8 450.8 0 0 1 50.048-0.8c14.416 0.656 28.736 3.328 43.584 5.184L512 439.152z m241.072 1.92L736 607.904h50.768c4.48-42.784 9.104-85.056 13.184-127.392 0.576-5.968 2.208-8.288 8.144-8.448 10.72-0.256 21.456-1.856 32.144-1.472 22.24 0.8 39.744 9.12 36 40.56-2.72 22.752-5.248 45.536-7.728 68.32-1.024 9.44-1.712 18.928-2.56 28.512h51.872c3.36-33.056 7.488-65.68 9.84-98.432 3.2-44.496-16.656-68.736-60.64-75.2-38.4-5.632-76.256-0.32-113.952 6.688z m-453.28 126.192c-8.192 1.216-15.36 2.624-22.592 3.264-24.048 2.096-48.112 3.696-71.536-4-13.04-4.304-23.136-11.792-27.936-24.336-7.408-19.408 0.832-44.16 18.592-56.544 16.288-11.36 35.36-14.928 54.8-14.928 21.136-0.016 42.272 2.272 63.968 3.6L320 437.28c-14.128-1.616-27.648-3.68-41.248-4.608-38.448-2.624-75.6 2.448-110.128 19.184-28.144 13.648-48.8 33.76-55.008 63.872-7.36 35.76 10.816 65.152 48.528 80.48 17.952 7.28 36.832 11.728 56.256 11.808 23.2 0.096 46.4-1.472 69.568-2.768 2.912-0.16 7.792-2.72 8.128-4.72 1.856-10.832 2.56-21.824 3.696-33.248z" fill="#67676c" p-id="2018"></path></svg>', name: 'csdn' },
      link: 'https://blog.csdn.net/Lane0218'
    },
    { icon: { svg: '<svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 24 24"><path fill="currentColor" d="M20 18h-2V9.25L12 13L6 9.25V18H4V6h1.2l6.8 4.25L18.8 6H20m0-2H4c-1.11 0-2 .89-2 2v12a2 2 0 0 0 2 2h16a2 2 0 0 0 2-2V6a2 2 0 0 0-2-2"/></svg>', name: 'mail' }, link: 'mailto:laneljc@qq.com' },
  ],
  navbarSocialInclude: ['github', 'gitee', 'csdn'], // 允许显示在导航栏的 social 社交链接
  aside: true, // 页内侧边栏， 默认显示在右侧
  outline: [2, 3], // 页内大纲， 默认显示 h2, h3

  /**
   * 文章版权信息
   * @see https://theme-plume.vuejs.press/guide/features/copyright/
   */
  // copyright: true,

  prevPage: true,   // 是否启用上一页链接
  nextPage: true,   // 是否启用下一页链接
  createTime: true, // 是否显示文章创建时间

  /* 站点页脚 */
  footer: {
    // message: 'Power by <a target="_blank" href="https://v2.vuepress.vuejs.org/">VuePress</a> & <a target="_blank" href="https://theme-plume.vuejs.press">vuepress-theme-plume</a>',
    message: '',
    copyright: 'Copyright © 2025 Lane',
  },

  /**
   * @see https://theme-plume.vuejs.press/config/basic/#profile
   */
  profile: {
    avatar: '/images/logo.png',
    name: 'Lane',
    description: '探索未知，解码未来',
    circle: true,
    location: '',
    organization: '',
    layout: 'left', // 个人信息在左侧还是右侧，'left' | 'right'
  },

  navbar,
  notes,

  /**
   * 公告板
   * @see https://theme-plume.vuejs.press/guide/features/bulletin/
   */
  // bulletin: {
  //   layout: 'top-right',
  //   contentType: 'markdown',
  //   title: '公告板标题',
  //   content: '公告板内容',
  // },

  /* 过渡动画 @see https://theme-plume.vuejs.press/config/basic/#transition */
  transition: {
    page: true,        // 启用 页面间跳转过渡动画
    postList: true,    // 启用 博客文章列表过渡动画
    // appearance: 'fade',  // 启用 深色模式切换过渡动画, 或配置过渡动画类型
  },

})
